espressif/esp-idf/examples/cxx/experimental/experimental_cpp_component/host_test/i2c/sdkconfig.defaults
CONFIG_UNITY_ENABLE_IDF_TEST_RUNNER=n
CONFIG_IDF_TARGET="linux"
CONFIG_CXX_EXCEPTIONS=y
